Here's the code I used to reproduce the problem:

```hcl
provider "aws" {region = "us-east-1"}

data "aws_iam_policy_document" "some_queue_role_policy" {
  statement {
    sid    = "CatalogServiceSQSRolePolicy"
    effect = "Allow"
    actions = [
      "sqs:GetQueueAttributes",
      "sqs:ListQueues",
      "sqs:ReceiveMessage",
      "sqs:ChangeMessageVisibility",
      "sqs:DeleteMessage",
      "sqs:GetQueueUrl",
      "sqs:SendMessage",
    ]
    resources = [
      aws_sqs_queue.some_queue.arn
    ]
    principals {
      type        = "AWS"
      identifiers = ["<iam role arn>"]
    }
  }
}

resource "aws_sqs_queue" "some_queue" {
  name                       = "some-queue"
  message_retention_seconds  = 86400
  visibility_timeout_seconds = 60
  sqs_managed_sse_enabled    = true
}

resource "aws_sqs_queue_policy" "some_queue_policy" {
  policy    = data.aws_iam_policy_document.some_queue_role_policy.json
  queue_url = aws_sqs_queue.some_queue.id
}
```

Here's the logs of the failure:

```
❯ tf apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.some_queue_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "some_queue_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ListQueues",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "CatalogServiceSQSRolePolicy"

          + principals {
              + identifiers = [
                  + "<iam role arn>",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_sqs_queue.some_queue will be created
  + resource "aws_sqs_queue" "some_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 0
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "some-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 60
    }

  # aws_sqs_queue_policy.some_queue_policy will be created
  + resource "aws_sqs_queue_policy" "some_queue_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_sqs_queue.some_queue: Creating...
aws_sqs_queue.some_queue: Still creating... [10s elapsed]
aws_sqs_queue.some_queue: Still creating... [20s elapsed]
aws_sqs_queue.some_queue: Creation complete after 27s [id=https://sqs.us-east-1.amazonaws.com/<account id>/some-queue]
data.aws_iam_policy_document.some_queue_role_policy: Reading...
data.aws_iam_policy_document.some_queue_role_policy: Read complete after 0s [id=370697860]
aws_sqs_queue_policy.some_queue_policy: Creating...
aws_sqs_queue_policy.some_queue_policy: Still creating... [10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [50s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [1m0s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [1m10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [1m20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [1m30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [1m40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [1m50s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [2m0s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [2m10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [2m20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [2m30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [2m40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [2m50s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [3m0s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [3m10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [3m20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [3m30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [3m40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [3m50s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [4m0s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [4m10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [4m20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [4m30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [4m40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [4m50s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [5m0s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [5m10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [5m20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [5m30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [5m40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [5m50s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [6m0s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [6m10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [6m20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [6m30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [6m40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [6m50s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [7m0s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [7m10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [7m20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [7m30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [7m40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [7m50s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [8m0s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [8m10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [8m20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [8m30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [8m40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [8m50s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [9m0s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [9m10s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [9m20s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [9m30s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [9m40s elapsed]
aws_sqs_queue_policy.some_queue_policy: Still creating... [9m50s elapsed]
╷
│ Error: setting SQS Queue (https://sqs.us-east-1.amazonaws.com/<account id>/some-queue) attribute (Policy): operation error SQS: SetQueueAttributes, https response error StatusCode: 400, RequestID: 64f18446-da0b-5577-b034-e43e6cf7492f, InvalidAttributeValue: Invalid value for the parameter Policy.
│ 
│   with aws_sqs_queue_policy.some_queue_policy,
│   on main.tf line 33, in resource "aws_sqs_queue_policy" "some_queue_policy":
│   33: resource "aws_sqs_queue_policy" "some_queue_policy" {
│ 
```

When enabling `TF_LOG=DEBUG`:

```
| {"__type":"com.amazonaws.sqs#InvalidAttributeValue","message":"Invalid value for the parameter Policy."}
   http.response.header.x_amzn_requestid=c81301a5-f4f2-5145-8dc4-61dd4e47db49 tf_aws.sdk=aws-sdk-go-v2 tf_aws.signing_region="" tf_req_id=f53d3e18-40ac-1517-84ff-1e1995d6b027 http.response.header.content_type=application/x-amz-json-1.0 http.response_content_length=104 rpc.method=SetQueueAttributes rpc.service=SQS tf_rpc=ApplyResourceChange @module=aws messaging.system=AmazonSQS http.status_code=400 rpc.system=aws-api http.response.header.date="Tue, 15 Apr 2025 19:50:13 GMT" net.peer.name=https://sqs.us-east-1.amazonaws.com/<account id>/some-queue aws.region=us-east-1 http.duration=448 http.response.header.connection=keep-alive timestamp=2025-04-15T12:50:13.087-0700
2025-04-15T12:50:13.088-0700 [DEBUG] provider.terraform-provider-aws_v5.94.1_x5: request failed with unretryable error https response error StatusCode: 400, RequestID: c81301a5-f4f2-5145-8dc4-61dd4e47db49, InvalidAttributeValue: Invalid value for the parameter Policy.: messaging.system=AmazonSQS net.peer.name=https://sqs.us-east-1.amazonaws.com/<account id>/some-queue rpc.system=aws-api tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=f53d3e18-40ac-1517-84ff-1e1995d6b027 tf_rpc=ApplyResourceChange @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.63/logging/tf_logger.go:45 rpc.service=SQS tf_aws.sdk=aws-sdk-go-v2 tf_provider_addr=registry.terraform.io/hashicorp/aws tf_resource_type=aws_sqs_queue_policy @module=aws rpc.method=SetQueueAttributes aws.region=us-east-1 timestamp=2025-04-15T12:50:13.088-0700
2025-04-15T12:50:13.591-0700 [DEBUG] provider.terraform-provider-aws_v5.94.1_x5: HTTP Request Sent: @module=aws http.request.header.x_amz_target=AmazonSQS.SetQueueAttributes aws.region=us-east-1 http.request.header.content_type=application/x-amz-json-1.0 rpc.service=SQS tf_provider_addr=registry.terraform.io/hashicorp/aws http.request.header.x_amzn_query_mode=true net.peer.name=sqs.us-east-1.amazonaws.com tf_resource_type=aws_sqs_queue_policy http.request.header.x_amz_security_token="*****" http.user_agent="APN/1.0 HashiCorp/1.0 Terraform/1.11.4 (+https://www.terraform.io) terraform-provider-aws/5.94.1 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go-v2/1.36.3 ua/2.1 os/macos lang/go#1.23.7 md/GOOS#darwin md/GOARCH#arm64 api/sqs#1.38.3 m/g" rpc.system=aws-api tf_aws.sdk=aws-sdk-go-v2 tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=f53d3e18-40ac-1517-84ff-1e1995d6b027 http.method=POST
```